---
kind: property
id: P:Autodesk.Revit.DB.DWFExportOptions.ExportTexture
source: html/ed6dac16-8a8f-96d8-3336-ec046cdfe14d.htm
---
# Autodesk.Revit.DB.DWFExportOptions.ExportTexture Property

Whether to export texture.

## Syntax (C#)
```csharp
public bool ExportTexture { get; set; }
```

## Remarks
The default value is true. This property only take effect to 3D DWF.